import React from "react";

import "../styles/Content.css";

export class Content extends React.Component {
  constructor(props) {
    super(props);
    this.changeColor = this.changeColor.bind(this);
  }

  changeColor(event) {
    event.target.style.background = this.getRandomColor();
    event.target.style.color = this.getRandomColor();
  }

  getRandomColor() {
    var letters = "0123456789ABCDEF";
    var color = "#";

    for (var i = 0; i < 6; i++) {
      color += letters[Math.floor(Math.random() * 16)];
    }
    return color;
  }

  render() {
    return (
      <>
        <div class="education">
          <h3>Освіта:</h3>
          <ul>
            <li>Спеціалізована школа №264 з поглибленим вивченням англійської мови</li>
            <li onClick={this.changeColor}>
              Київський політехнічний університет ім. Ігоря Сікорського
            </li>
          </ul>
        </div>
        <div class="hobby">
          <h3 onClick={this.changeColor}>Хобі:</h3>
          <ul>
            <li>Волейбол</li>
            <li>Народні танці</li>
            <li>Фехтування</li>
          </ul>
        </div>

        <div class="fav-films">
          <h3>Улюблені фільми:</h3>
          <ol>
            <li>Володар перснів, 2001-2003</li>
            <li>Голодні ігри, 2012-2015</li>
            <li>Привіт, Джулі, 2010</li>
            <li>Гордість та упередження, 2005</li>
          </ol>
        </div>

        <div class="fav-city">
          <h3>Місто, де залишилась частинка моєї душі</h3>
          <p>
            Ужгород — місто, обласний центр Закарпатської області, центр Ужгородської міської
            громади та Ужгородського району. Розташоване на річці Уж, за 811 км від Києва, на
            кордоні зі Словаччиною.
          </p>
          <h4>Ужгород туристичний: які пам’ятки відвідати</h4>
          <p>
            Сьогодні Ужгород один із найпопулярніших серед туристів міст. Головні його атракції
            переважно знаходяться як в самому його серці – Старому Місті, так і на його околицях:
          </p>
          <ul class="place-to-visit">
            <li class="place-to-visit__item">
              «Совине гніздо» – легендарна комора і винний льох Ужгорода, побудований ще в 1781
              році. Сьогодні це відреставрована унікальна архітектурна пам’ятка міста, яка
              розмістилася навпроти мерії, на підніжжі комітатські гірки. Колись в тутешніх пагорбах
              зберігали вино, пиво, зерно, сало, овечу вовну, а з недавніх пір в «Совине гніздо»
              вдихнули нове життя.
            </li>
            <li class="place-to-visit__item">
              «Білий дім» – одна з родзинок чеського кварталу Галагов, спроектована відомим чеським
              архітектором Антоном Крупко в стилі конструктивізму. Сьогодні тут працює
              облдержадміністрація.
            </li>
            <li class="place-to-visit__item">
              У ботанічному саду Ужгорода ви зможете сповна насолодитися більш ніж 5 тисячами рослин
              і 800 видів дерев і кущів! Тут навіть ростуть такі екзоти, як банан, папайя, евкаліпт,
              лавр. Неподалік розташований Підзамковий парк, де ви побачите найстаріше дерево
              Ужгорода – 500-річний платан, який посадили ще графи Другети.
            </li>
            <li class="place-to-visit__item">
              Ужгородський замок його краєзнавчий музей і дегустаційна залла. Фортеця, відома ще з Х
              ст., вражає суворим силуетом і історичними таємницями, які до сих пір живуть між її
              стінами. Резиденція таких епохальних фігур, як князь Лаборець, графи Другети, Ференц
              Ракоці, не могла залишитися без політичних, стратегічних і романтичних інтриг. А ще
              тут – вражаюча колекція експонатів і неймовірне ароматне закарпатське вино в
              казематах.
            </li>
            <li class="place-to-visit__item">
              Хрестовоздвиженський кафедральний собор – головний духовний центр Ужгорода, який
              належить Мукачівській греко-католицькій єпархії. Він вражає своїм дивовижним минулим,
              зовнішніми та внутрішніми декораціями.
            </li>
          </ul>
        </div>
      </>
    );
  }
}
